# UnHideObjects

## Description
Changes the object visibility to &quot;visible&quot; for all objects hidden with Hide, HideSelectedObjects and ShowOnlySelected commands. The object will only become visible if it is also on a visible layer and class.

```pascal
PROCEDURE UnHideObjects;
```

```python
def vs.UnHideObjects():
    return None
```

## Examples
```python
UnHideObjects();
```

```pascal
UnHideObjects;
```
```python
import vs

# Changes the object visibility to &quot;visible&quot; for all objects hidden
# with Hide, HideSelectedObjects and ShowOnlySelected commands.
vs.UnHideObjects()
```

## Version
Availability: from Vectorworks 2025

## Category
* Object Attributes